[
    {
        "text": ["As I grab my identification, I hold it up and stare at it in the one beacon of light that breaks through the darkness of the damp alleyway."]
    },
    {
        "text": ["In my fingers lies an elegant card, with “Dick Johnson : PRIVATE INVESTIGATOR”, printed in platinum Proxima Nova on sleek matte black cardstock",
            "Perfect."]
    },
    {
        "text": ["I place the card flat on the table, the blackness of the card contrasting with the table like ink in a water glass.", 
            "I set my legs across my stand and light a smoke, waiting in quiet anticipation for my first client."]
    },
    {
        "text": ["Just as I prepared to doze off, a figure emerged walking down the alleyway, silhouetting the dull morning sun like an eclipsing moon.",
        "As they got closer, I was able to give em a good look."]
    },
    {
        "text": ["It appeared to be a dame who resembled some sort of tall reptile.",
        "She looked a bit more humanoid than the folk that had been giving me the side eye from across the alley. "]
    },
    {   
        "text": ["YOU!"],
        "speaker": "natieks",
        "mood": "frustrated",
        "new": true
    },
    {
        "text": ["YOU SCAMMER DETECTIVE!!",
            "I WANT A REFUND!!!"],
        "speaker": "natieks",
        "mood": "frustrated"
    },
    {
        "text": ["...Huh?"],
        "speaker": "det",
        "mood": "frustrated",
        "new": true
    },
    {
        "text": ["I don’t recall taking a case from you.", "For that matter, I don’t even know who you are."],
        "speaker": "det",
        "mood": "frustrated"
    },
    {
        "text": ["DON’T LIE, OF COURSE YOU REMEMBER ME!"],
        "speaker": "natieks",
        "mood": "frustrated",
        "new": true
    },
    {
        "text": ["I met you just a few days ago in the local bar and hired you to figure out who graffitied my house!!",
        "I’d recognize that trenchcoat anywhere!!! And that dinky cowboy hat!!"],
        "speaker": "natieks",
        "mood": "frustrated"
    },
    {
        "text": ["The stranger points at my fedora as if to insinuate it’s a cowboy hat, an opinion as wrong as wearing socks in sandals."]
    },
    {
        "text": ["I take another smoke to alleviate this newfound stress. "]
    },
    {
        "text": ["As I stare at the billowing gray fumes I think to myself, “Maybe this isn’t worth it” ",
            "and once again look down to face this",
            "lady’s outstretched finger.."]
    },
    {
        "text": ["I sigh and collect myself.",
        "I need to make a good impression here if I want to expand my business, and more importantly I have a responsibility to help those in need."]
    },
    {
        "text": ["There must be some sort of mistake. I only settled on this planet a few days ago; I haven’t received any jobs, let alone a reputation beyond “newcomer”."],
        "speaker": "det",
        "mood": "inquisitive",
        "new": true
    }
]