[
    {
        "text": ["I know immediately from experience that my best bet will be speaking to the bartender."]
    },
    {
        "text": ["Unlike their transient customers, bartenders work regular shifts and any mixologist worth their money would pay careful attention to their patrons to avoid any funny business."]
    },
    {
        "text": ["I stroll up to the bar."]  
    },
    {
        "text": ["The bartender is occupied serving drinks to the other aliens, but narrows his eye at me as I approach."]
    },
    {
        "text": ["I can't help but be impressed at the skillful shake of the wrists of the bartender as he mixes multiple cocktails at a time, and serves them in quick succession."]
    },
    {
        "text": ["...For the last time sir, I can't serve you any drinks if you can't show me an ID."],
        "speaker": "bartender",
        "mood": "frustrated",
        "new": true
    },
    {
        "text": ["...Also if you're trying to disguise yourself by putting on a new hat, I'm afraid it's not working. "],
        "speaker": "bartender",
        "mood": "frustrated"
    },
    {
        "text": ["I'm Private Investigator Dick Johnson.",
        "I have some questions and by the looks of it, you can provide answers."],
        "speaker": "det",
        "mood": "neutral",
        "new": true
    },
    {
        "text": ["I flash the bartender my ID and slide over a business card for good measure."],
        "new": true
    },
    {
        "text": ["He squints at me, but I can sense that my greeting has him caught off guard."]
    },
    {
        "text": ["Oh I am very amazed..."],
        "speaker": "bartender",
        "mood": "inquisitive",
        "new": true
    },
    {
        "text": ["Did you change personalities when you took off that cowboy hat?", 
        "It's almost like you're a different person."],
        "speaker": "bartender",
        "mood": "inquisitive"
    },
    {
        "text": ["Cowboy hat?! I would never!"],
        "speaker": "det",
        "mood": "frustrated",
        "new": true
    },
    {
        "text": ["... But anyway, that's besides the point-"],
        "speaker": "det",
        "mood": "inquisitive"
    },
    {
        "text": ["This cowboy detective...",
            "could you describe in detail the circumstances when you last saw them?",
            "They may be impersonating me."],
        "speaker": "det",
        "mood": "inquisitive"
    },
    {
        "text": ["Well if they are, just last night, your lookalike came in here trying to solve some kind of case, he said."],
        "speaker": "bartender",
        "mood": "neutral",
        "new": true
    },
    {
        "text": ["But it was strange."],
        "speaker": "bartender",
        "mood": "inquisitive"
    },
    {
        "text": ["If I recall, he asked for a drink and when I said I didn't serve without ID, he threw a tantrum and left."],
        "speaker": "bartender",
        "mood": "neutral"
    },
    {
        "text": ["Then after some time passed he came back with a cake box and went over to the stage and talked to the lady performing.",
            "Left a half hour later."],
        "speaker": "bartender",
        "mood": "neutral"
    },
    {
        "text": ["I see… thank you for your time.", "I appreciate the cooperation."],
        "speaker": "det",
        "mood": "neutral",
        "new": true
    },
    {
        "text": ["No problem."],
        "speaker": "bartender",
        "mood": "neutral",
        "new": true
    }
]